SmallCoral/STM32Car/User/funtion.h
#include "stm32f10x.h"                  // Device header
#include "Delay.h"
#include "OLED.h"
#include "Motor.h"
#include "Infrared.h"
#include "Key.h"
#include "buzzer.h" 
#include "LED.h" 

#define BLACK_LINE_DETECTED 0    // 红外传感器低电平表示检测到黑线
#define WHITE_SURFACE_DETECTED 1 // 红外传感器高电平表示检测到白色
 
uint8_t tracking = 0;  // 巡线模式标志
uint8_t speed = 30;     // 小车运行速度
uint8_t black_detected = 0; // 黑线检测标志，用于确保LED_FMQ()只执行一次

void LED_FMQ(void)
{
	LED_ON();
	Buzzer_ON();     
  Delay_ms(500);
	LED_OFF();
  Buzzer_OFF();    
  Delay_ms(500); 
	
}

void made1(void)		//第一题
{
    // 读取红外传感器状态
    uint8_t i1 = GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_10); // 左前传感器
    uint8_t i2 = GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_11); // 右前传感器
    uint8_t i3 = GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_14);
    uint8_t i4 = GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_15);

    if (GetKeyState(GPIO_Pin_13, GPIOC)) // 检测KEY0
    {
        tracking = !tracking; // 切换巡线模式状态
        if (!tracking)
        {
            Motor_Stop();
            OLED_ShowString(3, 1, "Stopped         ");
            black_detected = 0; // 重置黑线检测标志
        }
    }

    if (tracking && !black_detected) // 小车巡线模式且未检测到黑线
    {
        if (i1 == BLACK_LINE_DETECTED && i2 == BLACK_LINE_DETECTED && 
            i3 == BLACK_LINE_DETECTED && i4 == BLACK_LINE_DETECTED)
        {
            Motor_GoStraight(speed); // 前进
            OLED_ShowString(3, 1, "Moving          ");
        }
        else // 检测到黑线
        {
            Motor_Stop();
            OLED_ShowString(3, 1, "Black Line Detected");
            LED_FMQ(); // 执行一次LED_FMQ
            black_detected = 1; // 标志设置，确保不再重复执行
        }
    }

}

void made2(void)
{
		if (GetKeyState(GPIO_Pin_13, GPIOC)) // 检测KEY0
		{
				static uint8_t moving = 0;
				moving = !moving; // 切换移动状态
				if (moving)
				{
						Motor_GoStraight(speed);
						OLED_ShowString(3, 1, "Moving          ");
						Delay_s(3);
						Motor_Stop();
						OLED_ShowString(3, 1, "Stopped         ");
						LED_FMQ();
				}
				else
				{
						Motor_Stop();
						OLED_ShowString(3, 1, "Stopped         ");
				}
		}
}
